app/controllers/account_activations_controller.rb

  def edit
    user = User.find_by email: params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mixigaming@example.com"], ["LIMIT", 1]]