app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    if @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 59], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_by(id: params[:id])